files/collections/PMAK-68ba2ba23093ae0001f335c5-6ac1ba92c75a29f896e9dfcec3ef2ebefe/11-13-2025/7263510-z - will be deleted Oct 31st - BI Publisher.json

{"collection":{"info":{"_postman_id":"b5d897bc-6f72-4c67-a11a-1e55031e1fe2","name":"z - will be deleted Oct 31st - BI Publisher","description":"# BI Publisher\nNote: Reports will need to be set up manually per instance!\n\n## Functional Guide link\n[Guide](https://docs.google.com/document/d/13hFdGuP02BtyOMRHsvakl-Fy3ifWSlkDbYh9_HWwjG4/edit?usp=sharing \"Guide Link\")","schema":"https://schema.getpostman.com/json/collection/v2.1.0/collection.json","updatedAt":"2025-10-05T07:41:04.000Z","createdAt":"2023-03-12T20:36:15.000Z","lastUpdatedBy":"8039775","uid":"7263510-b5d897bc-6f72-4c67-a11a-1e55031e1fe2"},"item":[{"name":"Dynamic SQL","item":[{"name":"SQL with PL/SQL Initialisation","event":[{"listen":"test","script":{"exec":[""],"type":"text/javascript","id":"01b2c6c4-5fc3-4d9d-8979-765362fe9f24"}}],"id":"4bef9d67-5ae5-40e1-946f-c7701c4d40b3","protocolProfileBehavior":{"disableBodyPruning":true},"request":{"method":"POST","header":[{"key":"Content-Type","value":"application/soap+xml"},{"key":"SOAPAction","value":""}],"body":{"mode":"raw","raw":"<soapenv:Envelope xmlns:pub=\"http://xmlns.oracle.com/oxp/service/PublicReportService\" xmlns:soapenv=\"http://www.w3.org/2003/05/soap-envelope\">\r\n  <soapenv:Body>\r\n    <pub:runReport>\r\n      <pub:reportRequest>\r\n        <pub:reportAbsolutePath>/Custom/More4apps/SQLReport/SQLReport.xdo</pub:reportAbsolutePath>\r\n        <pub:sizeOfDataChunkDownload>-1</pub:sizeOfDataChunkDownload>\r\n        <pub:attributeLocale>en-US</pub:attributeLocale>\r\n        <pub:attributeTemplate>Default</pub:attributeTemplate>\r\n        <pub:attributeFormat>xml</pub:attributeFormat>\r\n        <pub:byPassCache>true</pub:byPassCache>\r\n        <pub:flattenXML>false</pub:flattenXML>\r\n        <pub:parameterNameValues>\r\n          <pub:item>\r\n            <pub:name>PLSQL</pub:name>\r\n            <pub:values>\r\n              <pub:item><![CDATA[ MO_GLOBAL.Init('AP_MANAGE_PAYABLES_INVOICE_DATA');  ]]></pub:item>\r\n            </pub:values>\r\n          </pub:item>\r\n          <pub:item>\r\n            <pub:name>QUERY</pub:name>\r\n            <pub:values>\r\n              <pub:item><![CDATA[ SELECT * FROM (SELECT * FROM ap_invoices) WHERE ROWNUM <= 2 ]]></pub:item>\r\n            </pub:values>\r\n          </pub:item>\r\n        </pub:parameterNameValues>\r\n      </pub:reportRequest>\r\n    </pub:runReport>\r\n  </soapenv:Body>\r\n</soapenv:Envelope>"},"url":{"raw":"{{ServerName}}/xmlpserver/services/ExternalReportWSSService","host":["{{ServerName}}"],"path":["xmlpserver","services","ExternalReportWSSService"]},"description":"A report to run standard SQL with PL/SQL initialisation."},"response":[],"uid":"7263510-4bef9d67-5ae5-40e1-946f-c7701c4d40b3"},{"name":"Date SQL Parameters","event":[{"listen":"test","script":{"exec":[""],"type":"text/javascript","id":"914315cc-2c57-430a-acc4-fdecd98269f6"}}],"id":"def56df3-b120-4118-bbf5-d4b28bbd95b2","protocolProfileBehavior":{"disableBodyPruning":true},"request":{"method":"POST","header":[{"key":"Content-Type","value":"application/soap+xml"},{"key":"SOAPAction","value":""}],"body":{"mode":"raw","raw":"<soapenv:Envelope xmlns:soapenv=\"http://www.w3.org/2003/05/soap-envelope\" xmlns:pub=\"http://xmlns.oracle.com/oxp/service/PublicReportService\">\r\n   <soapenv:Header/>\r\n   <soapenv:Body>\r\n      <pub:runReport>\r\n         <pub:reportRequest>\r\n         \t<!-- Note that the report may change -->\r\n          <pub:reportAbsolutePath>/Custom/More4apps/SQLReport/SQLReport.xdo</pub:reportAbsolutePath>\r\n          <pub:sizeOfDataChunkDownload>-1</pub:sizeOfDataChunkDownload>\r\n          <pub:attributeLocale>en-US</pub:attributeLocale>\r\n          <pub:attributeTemplate>Default</pub:attributeTemplate>\r\n          <pub:attributeFormat>xml</pub:attributeFormat>\r\n\t     <pub:byPassCache>true</pub:byPassCache>\r\n\t     <!-- Ensure the data is normalised with false -->\r\n\t\t<pub:flattenXML>false</pub:flattenXML>\r\n          <!-- Parameter Binds -->\r\n          <pub:parameterNameValues>\r\n             <!-- Query Parameter -->\r\n             <pub:item>\r\n                <pub:name>QUERY</pub:name>\r\n                <pub:values>\r\n                  <pub:item><![CDATA[ SELECT APPROVED_DATE\r\n\t\t\t\t\t\t\t\tFROM PO_HEADERS_ALL\r\n\t\t\t\t\t\t\t\tWHERE\r\n\t\t\t\t\t\t\t\t\t(TO_CHAR(APPROVED_DATE, 'yyyymmddHH24MISS') IN ('20120712140634')\r\n\t\t\t\t\t\t\t\t\t\tOR TO_CHAR(APPROVED_DATE, 'yyyymmdd') IN ('20120712')) ]]></pub:item>\r\n             \t </pub:values>\r\n             </pub:item>\r\n             <!-- End Query Parameter -->\r\n            </pub:parameterNameValues>\r\n        </pub:reportRequest>\r\n      </pub:runReport>\r\n   </soapenv:Body>\r\n</soapenv:Envelope>"},"url":{"raw":"{{ServerName}}/xmlpserver/services/ExternalReportWSSService","host":["{{ServerName}}"],"path":["xmlpserver","services","ExternalReportWSSService"]},"description":"A report to run standard SQL with date binds."},"response":[],"uid":"7263510-def56df3-b120-4118-bbf5-d4b28bbd95b2"},{"name":"Date SQL Parameters Copy","event":[{"listen":"test","script":{"exec":[""],"type":"text/javascript","id":"29d4b814-837e-4606-bb2b-1d99673c8e37"}}],"id":"0c7cc3c0-00ea-4434-94f9-38e91718cf58","protocolProfileBehavior":{"disableBodyPruning":true},"request":{"method":"POST","header":[{"key":"Content-Type","value":"application/soap+xml"},{"key":"SOAPAction","value":""}],"body":{"mode":"raw","raw":"<soapenv:Envelope xmlns:soapenv=\"http://www.w3.org/2003/05/soap-envelope\" xmlns:pub=\"http://xmlns.oracle.com/oxp/service/PublicReportService\">\r\n   <soapenv:Header/>\r\n   <soapenv:Body>\r\n      <pub:runReport>\r\n         <pub:reportRequest>\r\n         \t<!-- Note that the report may change -->\r\n          <pub:reportAbsolutePath>/Custom/More4apps/More4appsSQL.xdo</pub:reportAbsolutePath>\r\n          <pub:sizeOfDataChunkDownload>-1</pub:sizeOfDataChunkDownload>\r\n          <pub:attributeLocale>en-US</pub:attributeLocale>\r\n          <pub:attributeTemplate>Default</pub:attributeTemplate>\r\n          <pub:attributeFormat>xml</pub:attributeFormat>\r\n\t     <pub:byPassCache>true</pub:byPassCache>\r\n\t     <!-- Ensure the data is normalised with false -->\r\n\t\t<pub:flattenXML>false</pub:flattenXML>\r\n          <!-- Parameter Binds -->\r\n          <pub:parameterNameValues>\r\n             <!-- Query Parameter -->\r\n             <pub:item>\r\n                <pub:name>QUERY</pub:name>\r\n                <pub:values>\r\n                  <pub:item><![CDATA[ SELECT APPROVED_DATE\r\n\t\t\t\t\t\t\t\tFROM PO_HEADERS_ALL\r\n\t\t\t\t\t\t\t\tWHERE\r\n\t\t\t\t\t\t\t\t\t(TO_CHAR(APPROVED_DATE, 'yyyymmddHH24MISS') IN ('20120712140634')\r\n\t\t\t\t\t\t\t\t\t\tOR TO_CHAR(APPROVED_DATE, 'yyyymmdd') IN ('20120712')) ]]></pub:item>\r\n             \t </pub:values>\r\n             </pub:item>\r\n             <!-- End Query Parameter -->\r\n            </pub:parameterNameValues>\r\n        </pub:reportRequest>\r\n      </pub:runReport>\r\n   </soapenv:Body>\r\n</soapenv:Envelope>"},"url":{"raw":"{{ServerName}}/xmlpserver/services/ExternalReportWSSService","host":["{{ServerName}}"],"path":["xmlpserver","services","ExternalReportWSSService"]},"description":"A report to run standard SQL with date binds."},"response":[],"uid":"7263510-0c7cc3c0-00ea-4434-94f9-38e91718cf58"}],"id":"3de26362-14fc-4076-9f5b-e9f6580c2801","uid":"7263510-3de26362-14fc-4076-9f5b-e9f6580c2801"},{"name":"Has Report Directory","id":"d75beec8-0656-473a-b02b-af5e5d648bfd","protocolProfileBehavior":{"disableBodyPruning":true},"request":{"method":"POST","header":[{"key":"Content-Type","name":"Content-Type","value":"application/soap+xml","type":"text"},{"key":"SOAPAction","value":"","type":"text"}],"body":{"mode":"raw","raw":"<soapenv:Envelope xmlns:pub=\"http://xmlns.oracle.com/oxp/service/PublicReportService\" xmlns:soapenv=\"http://www.w3.org/2003/05/soap-envelope\">\r\n  <soapenv:Body>\r\n    <pub:isReportExist>\r\n      <pub:reportAbsolutePath>/Custom/More4apps/SQLReport/SQLReport.xdo</pub:reportAbsolutePath>\r\n    </pub:isReportExist>\r\n  </soapenv:Body>\r\n</soapenv:Envelope>"},"url":{"raw":"{{ServerName}}/xmlpserver/services/ExternalReportWSSService","host":["{{ServerName}}"],"path":["xmlpserver","services","ExternalReportWSSService"]},"description":"Determines whether a report exists."},"response":[],"uid":"7263510-d75beec8-0656-473a-b02b-af5e5d648bfd"},{"name":"Validate User","id":"06fc3300-dd41-409a-9f02-436cc3b90285","protocolProfileBehavior":{"disableBodyPruning":true},"request":{"auth":{"type":"noauth"},"method":"POST","header":[{"key":"Content-Type","name":"Content-Type","type":"text","value":"application/soap+xml"},{"key":"SOAPAction","type":"text","value":""}],"body":{"mode":"raw","raw":"<soapenv:Envelope xmlns:pub=\"http://xmlns.oracle.com/oxp/service/PublicReportService\" xmlns:soapenv=\"http://www.w3.org/2003/05/soap-envelope\">\r\n  <soapenv:Body>\r\n    <pub:login>\r\n      <pub:userID>{{Username}}</pub:userID>\r\n      <pub:password>{{Password}}</pub:password>\r\n    </pub:login>\r\n  </soapenv:Body>\r\n</soapenv:Envelope>"},"url":{"raw":"{{ServerName}}/xmlpserver/services/PublicReportService","host":["{{ServerName}}"],"path":["xmlpserver","services","PublicReportService"]},"description":"# Documentation\r\nhttps://docs.oracle.com/middleware/12213/bip/BIPDV/securityservice.htm#BIPDV486\r\n\r\n## Example\r\nhttps://datacadamia.com/viz/bip/web_service"},"response":[],"uid":"7263510-06fc3300-dd41-409a-9f02-436cc3b90285"},{"name":"Agreement Number Report","event":[{"listen":"test","script":{"id":"796b455c-b969-4ed9-8672-d9a96b84b2b7","exec":[""],"type":"text/javascript"}}],"id":"91b359ab-57d0-4d93-8cce-389807cbfa44","protocolProfileBehavior":{"disableBodyPruning":true},"request":{"method":"POST","header":[{"key":"Content-Type","value":"application/soap+xml"},{"key":"SOAPAction","value":""},{"key":"Accept-Language","value":"ES","type":"text"}],"body":{"mode":"raw","raw":"<soapenv:Envelope xmlns:pub=\"http://xmlns.oracle.com/oxp/service/PublicReportService\" xmlns:soapenv=\"http://www.w3.org/2003/05/soap-envelope\">\r\n  <soapenv:Body>\r\n    <pub:runReport>\r\n      <pub:reportRequest>\r\n        <pub:reportAbsolutePath>/Custom/More4apps/Procurement/DocumentBuilder_AgreementNumber_REPORT.xdo</pub:reportAbsolutePath>\r\n        <pub:sizeOfDataChunkDownload>-1</pub:sizeOfDataChunkDownload>\r\n        <pub:attributeLocale>en-US</pub:attributeLocale>\r\n        <pub:attributeTemplate>Default</pub:attributeTemplate>\r\n        <pub:attributeFormat>xml</pub:attributeFormat>\r\n        <pub:byPassCache>true</pub:byPassCache>\r\n        <pub:flattenXML>false</pub:flattenXML>\r\n        <pub:parameterNameValues>\r\n          <pub:item>\r\n            <pub:name>AGREEMENT_NUMBER_SEARCH</pub:name>\r\n            <pub:values>\r\n              <pub:item>%</pub:item>\r\n            </pub:values>\r\n          </pub:item>\r\n        </pub:parameterNameValues>\r\n      </pub:reportRequest>\r\n    </pub:runReport>\r\n  </soapenv:Body>\r\n</soapenv:Envelope>"},"url":{"raw":"{{ServerName}}/xmlpserver/services/ExternalReportWSSService","host":["{{ServerName}}"],"path":["xmlpserver","services","ExternalReportWSSService"]},"description":"A report to run standard SQL. This uses the REF CURSOR ability to run SQL statements. SQL is passed through as a parameter and run.\n\n## Parameters\n# QUERY\nA Base64 string SQL statements wrapped in <![CDATA[ ]]>. Inline parameters are not supported."},"response":[],"uid":"7263510-91b359ab-57d0-4d93-8cce-389807cbfa44"},{"name":"Date Report","event":[{"listen":"test","script":{"exec":[""],"type":"text/javascript","id":"156a4bf9-28e8-4cea-91bc-4fb0f657c593"}}],"id":"2f645bcb-1bfb-4082-8c10-d63ebd798646","protocolProfileBehavior":{"disableBodyPruning":true},"request":{"method":"POST","header":[{"key":"Content-Type","value":"application/soap+xml"},{"key":"SOAPAction","value":""}],"body":{"mode":"raw","raw":"<soapenv:Envelope xmlns:pub=\"http://xmlns.oracle.com/oxp/service/PublicReportService\" xmlns:soapenv=\"http://www.w3.org/2003/05/soap-envelope\">\r\n  <soapenv:Body>\r\n    <pub:runReport>\r\n      <pub:reportRequest>\r\n        <!-- Set up a report with SELECT  invoice_id, invoice_date FROM ap_invoices_all WHERE invoice_date IN (:DATE1)  -->\r\n        <pub:reportAbsolutePath>/Custom/Test/Date_Test_Report.xdo</pub:reportAbsolutePath>\r\n        <pub:sizeOfDataChunkDownload>-1</pub:sizeOfDataChunkDownload>\r\n        <pub:attributeLocale>en-US</pub:attributeLocale>\r\n        <pub:attributeTemplate>Default</pub:attributeTemplate>\r\n        <pub:attributeFormat>xml</pub:attributeFormat>\r\n        <pub:byPassCache>true</pub:byPassCache>\r\n        <pub:flattenXML>false</pub:flattenXML>\r\n        <pub:parameterNameValues>\r\n          <pub:item>\r\n            <pub:name>DATE1</pub:name>\r\n            <pub:values>\r\n              <pub:item>01-01-2012</pub:item> <!-- 01-01-2012 -->\r\n              <pub:item>01-04-2012</pub:item> <!-- 04-01-2012 -->\r\n            </pub:values>\r\n          </pub:item>\r\n        </pub:parameterNameValues>\r\n      </pub:reportRequest>\r\n    </pub:runReport>\r\n  </soapenv:Body>\r\n</soapenv:Envelope>"},"url":{"raw":"{{ServerName}}/xmlpserver/services/ExternalReportWSSService","host":["{{ServerName}}"],"path":["xmlpserver","services","ExternalReportWSSService"]},"description":"# Date support within BI Publisher\n\n## Setting up the report.\nCreate a SQL statement of:  \n`SELECT invoice_date FROM AP_INVOICES_ALL WHERE invoice_date IN (:DATE1)`\n\nNext set up the DATE1parameter with a Date type and format of:  \n`MM-dd-yyyy`"},"response":[],"uid":"7263510-2f645bcb-1bfb-4082-8c10-d63ebd798646"},{"name":"DateTime Report","event":[{"listen":"test","script":{"exec":[""],"type":"text/javascript","id":"84293dc5-5f52-4b05-a962-280545da6f0f"}}],"id":"f3d45100-229a-4ffc-8a66-7ce953b6aeb5","protocolProfileBehavior":{"disableBodyPruning":true},"request":{"method":"POST","header":[{"key":"Content-Type","value":"application/soap+xml"},{"key":"SOAPAction","value":""}],"body":{"mode":"raw","raw":"<soapenv:Envelope xmlns:pub=\"http://xmlns.oracle.com/oxp/service/PublicReportService\" xmlns:soapenv=\"http://www.w3.org/2003/05/soap-envelope\">\r\n  <soapenv:Body>\r\n    <pub:runReport>\r\n      <pub:reportRequest>\r\n        <!-- Set up a report with SELECT invoice_id, invoice_date FROM ap_invoices_all WHERE invoice_date IN (:DATE1)  -->\r\n        <pub:reportAbsolutePath>/Custom/Test/Date_Test_Report.xdo</pub:reportAbsolutePath>\r\n        <pub:sizeOfDataChunkDownload>-1</pub:sizeOfDataChunkDownload>\r\n        <pub:attributeLocale>en-US</pub:attributeLocale>\r\n        <pub:attributeTemplate>Default</pub:attributeTemplate>\r\n        <pub:attributeFormat>xml</pub:attributeFormat>\r\n        <pub:byPassCache>true</pub:byPassCache>\r\n        <pub:flattenXML>false</pub:flattenXML>\r\n        <pub:parameterNameValues>\r\n          <pub:item>\r\n            <pub:name>DATE_TIME</pub:name>\r\n            <pub:values>\r\n              <pub:item>12-04-201306:54:34</pub:item> <!-- 2013-12-04T06:54:34.000+00:00 -->\r\n              <pub:item>08-12-201420:41:18</pub:item> <!-- 2014-08-12T20:41:18.000+00:00 -->\r\n            </pub:values>\r\n          </pub:item>\r\n        </pub:parameterNameValues>\r\n      </pub:reportRequest>\r\n    </pub:runReport>\r\n  </soapenv:Body>\r\n</soapenv:Envelope>"},"url":{"raw":"{{ServerName}}/xmlpserver/services/ExternalReportWSSService","host":["{{ServerName}}"],"path":["xmlpserver","services","ExternalReportWSSService"]},"description":"# Date support within BI Publisher\n\n## Setting up the report.\nCreate a SQL statement of:  \n`SELECT creation_date FROM AP_INVOICES_ALL WHERE creation_date IN (:DATE_TIME)`\n\nNext set up the DATE_TIME parameter with a Date type and format of:  \n`MM-dd-yyyyHH:mm:ss`"},"response":[],"uid":"7263510-f3d45100-229a-4ffc-8a66-7ce953b6aeb5"}],"auth":{"type":"basic","basic":[{"key":"username","value":"{{Username}}","type":"string"},{"key":"password","value":"{{Password}}","type":"string"}]},"event":[{"listen":"prerequest","script":{"type":"text/javascript","exec":["","/**"," * Global functions collection for use within requests"," **/"," globalFunctions = {","     ","    /**","    * getOBIEEReportBytes","    * @description Retrieves the OBIEE report bytes from the XML response","    * @param pm - postman variable containing response","    * @return Report bytes","    **/","    getOBIEEReportBytes: function(pm) {","        // Convert to JSON so we can retrieve the report bytes","        var jsonObject = xml2Json(pm.response.text());","        // Return the report bytes","        return jsonObject['env:Envelope']['env:Body']['ns2:runReportResponse']['ns2:runReportReturn']['ns2:reportBytes'];","    },","    ","    /**","    * decodeOBIEEcontent2json","    * @description Decodes OBIEE Base64 content as JSON","    * @param pm - postman variable containing response","    * @return Base64 decoded content as JSON","    **/","    decodeOBIEEcontent2json: function(pm) {","        // Return the report bytes","        var base64Content = globalFunctions.getOBIEEReportBytes(pm);","        // Parse the base6 bytes","        var intermediate = CryptoJS.enc.Base64.parse(base64Content);","        // Return the UTF-8 decoded string","        var utf8xml = CryptoJS.enc.Utf8.stringify(intermediate);","        // Log the Base64","        console.log(\"Base64 report: \", utf8xml);","        // Convert the XML to JSON","        var jsonReport = xml2Json(utf8xml);","        // Log the JSON","        console.log(\"JSON report: \", jsonReport);","        // Return the UTF-8 string as JSON","        return jsonReport;","    }"," }"],"id":"cc83edb5-7bb0-44bc-a59d-c67e6f8e314d"}},{"listen":"test","script":{"type":"text/javascript","exec":["/* Generic OBIEE tests */","pm.test(\"should return 200 on successful response\", function () { ","    pm.response.to.have.status(200);","});","","pm.test(\"should return the report as a base64 encoded string\", function() {","    var reportBytes = globalFunctions.getOBIEEReportBytes(pm);","    pm.expect(reportBytes).to.not.be.null;","});"],"id":"d09d0a48-4ce2-44c4-a378-9f1de8b3dda1"}}]}}